//Работа с компонентами в Vue Если мы посмотрим на какой-нибудь сайт, то можем
выделить на нем некоторые блоки: хедер, контент, сайдбар, футер. При создании
сайта на Vue мы также можем использовать такие независимые блоки. Они позволят
нам лучше организовать наш код и упростят его дальнейшую поддержку. Во Vue такие
блоки называются компонентами. В крупных приложениях разделение на компоненты
становится обязательным условием для сохранения управляемости процесса
разработки Компоненты рекомендовано размещать в папке components. Каждый
компонент в отдельном файле в виде модуля ES6.
